[
{"title": ["Get 4 Essential CyberSecurity Software For Less Than $10 Per Month"], "date": ["March 22, 2019"], "author": ["Exclusive Deals"], "content": ["\n", "\nMajor data breaches and cyber attacks are occurring at an alarming rate, and if you are still not using a VPN and password manager app, you are seriously out of excuses.", "\n", "\nNot just VPN software and a password manager, cybersecurity experts also recommend using antivirus and backup solutions to protect your computers and precious data stored on them. Unfortunately, to cover these bases, one would typically have to spend at least $30 per month.", "\n", "\nHowever, here we have great news for millions of The Hacker News readers.", "\n", "\nCybersecurity companies partnered with ", " have exclusively launched a new subscription package called — ", " — that slashes the price for top security apps everyone needs to use.", "\n", "\nAt just $9.99 monthly subscription, you can now get licenses for four award-winning cybersecurity apps:", "\n", "\n", "\n", "\n", " — usual price: $4.99 per month — is one of the most popular and secure password manager software. It makes it easy for users to sync their usernames and passwords between their devices.", "\n", "\nDashlane stores users' data in a military-grade vault with two-factor security. Besides, Dashlane allows users to generate new secure passwords and fill checkout forms with just one click.", "\n", "\n", " — usual price: $12.95 per month — is a highly-rated service that helps users stay secure online, with double 2048-bit encryption and a built-in kill switch. You can connect to 3,521 worldwide servers in 61 different countries, and the company keeps no logs, to preserve your privacy.", "\n", "\nWhether from accidental deletion, ransomware attack or hard drive failure, data loss occurs more often than you might think.", "\n", "\nSo, backing up your important data is always essential. Vault package also includes a 2TB of cloud storage from Degoo backup service provider that will keep your files secure.", "\n", "\n", "— usual price: $9.99 per month – is a the cloud storage platform that uses 256-bit AES encryption with automatic syncing and secure file sharing.", "\n", "\nFinally, ", " — usual price: $4.99 per month — helps avoid both malware and online fraud. Available on Windows, Mac, and Android, Panda uses artificial intelligence to detect threats.", "\n", "\nThat means it can block even brand new malware. The service also provides parental controls and can help locate missing devices.", "\n", "\nAll these subscription-based cybersecurity apps would typically cost you around $31.92 per month if purchased separately from their official websites.", "\n", "\nHowever, with Vault, you can ", " for just $9.99 per month — that's a saving of about $264 per year.", "\n", "\nOrder now to get an instant security upgrade. Stay hidden. Stay secure. Stay safe. Stay prepared."], "img_link": ["https://1.bp.blogspot.com/-ta61Ik8NCl4/XJTASu1V0RI/AAAAAAAAzk4/6mmK_A6AW1ksZlkM1yMlO4Cg6Tdubb8YACLcBGAs/s728-e100/best-cybersecurity-software.png"]},
{"title": ["PuTTY Releases Important Software Update to Patch 8 High-Severity Flaws"], "date": ["March 20, 2019"], "author": ["Wang Wei"], "content": ["\n", "\nThe popular SSH client program PuTTY has released the latest version of its software that includes security patches for 8 high-severity security vulnerabilities.", "\n", "\nPuTTY is one of the most popular and widely used open-source client-side programs that allows users to remotely access computers over SSH, Telnet, and Rlogin network protocols.", "\n", "\nAlmost 20 months after releasing the last version of its software, the developers of PuTTY earlier this week released the latest version 0.71 for Windows and Unix operating systems.", "\n", "\nAccording to an ", " available on its website, all previous versions of the PuTTY software have been found vulnerable to multiple security vulnerabilities that could allow a malicious server or a compromised server to hijack client's system in different ways.", "\n", "\nHere below I have listed all 8 vulnerabilities with brief information that PuTTY 0.71 has patched:", "\n", "\n", " — Since PuTTY doesn't have a way to indicate whether a piece of terminal output is genuine, the user-interface issue could be exploited by a malicious server to generate a fake authentication prompt at the client side, prompting victims to enter their private key passphrases.", "\n", "\n", "\n", "\n", " — When a user launches the online help within the PuTTY GUI tools, the software tries to locate its help file alongside its own executable.", "\n", "\nThis behavior could allow an attacker to trick the user into executing malicious code on the client system via the hijacking CHM file.", "\n", "\n", "\n", " — According to the advisory, if a server opens too many port forwardings, PuTTY for Unix does not bounds-check the input file descriptor it collects while monitoring the collections of active Unix file descriptors for activity, leading to a buffer overflow issue.", "\n", "\n", "\n", "\n", " — This issue resides in the way cryptographic random number generator in PuTTY, occasionally using the same batch of random bytes twice.", "\n", "\n", "\n", "\n", "— All prior versions of PuTTY suffers an Integer overflow issue due to missing key-size check-in RSA key exchange.", "\n", "\nA remote server can trigger the vulnerability by sending a short RSA key, leading to an integer overflow and uncontrolled overwriting of memory.", "\n", "\nPuTTY developers are not sure if this flaw can be exploited to gain control over the client, but since the issue occurs during key exchange and happens before host key checking, the overflow can be induced by a MitM attack even if the middle man does not know the correct host key.", "\n", "\nSo even if you trust the server you think you are connecting to, you are not safe.\"", "\n", "\n", "— Last three vulnerabilities in PuTTY allows a server to crash, or slow down client's terminal by sending different text outputs.", "\n", "\nServers can send a long unbroken string of Unicode characters to the client’s terminal, which could lead to a denial-of-service attack by causing the system to allocate potentially unlimited amounts of memory.", "\n", "\nThe second DoS attack can be triggered by sending combining characters, double-width text, an odd number of terminal columns, and GTK to the client's terminal in output.", "\n", "\nIn the third DoS attack, by sending width-2 characters used by Chinese, Japanese and Korean to the client, PuTTY's terminal emulator can be forced to crash.", "\n", "\nIf you use PuTTY, make sure you download and use the latest version of it."], "img_link": ["https://1.bp.blogspot.com/-3fqOAzErMkw/XJII4_voryI/AAAAAAAAAr0/KCC3pzKLrPcG7uMyjQsatMJ4fB7g94JHwCLcBGAs/s728-e100/putty-software-update.jpg"]},
{"title": ["Medtronic's Implantable Defibrillators Vulnerable to Life-Threatening Hacks"], "date": ["March 22, 2019"], "author": ["Swati Khandelwal"], "content": ["\n", "\nThe U.S. Department of Homeland Security Thursday issued an advisory warning people of severe vulnerabilities in over a dozen heart defibrillators that could allow attackers to fully hijack them remotely, potentially putting lives of millions of patients at risk.", "\n", "\nCardioverter Defibrillator is a small surgically implanted device (in patients' chests) that gives a patient's heart an electric shock (often called a countershock) to re-establish a normal heartbeat.", "\n", "\nWhile the device has been designed to prevent sudden death, several implanted cardiac defibrillators made by one of the world's largest medical device companies ", "have been found vulnerable to two serious vulnerabilities.", "\n", "\nDiscovered by researchers from security firm Clever Security, the vulnerabilities could allow threat actors with knowledge of medical devices to intercept and potentially impact the functionality of these life-saving devices.", "\n", "\n", "\n", "\nThe vulnerabilities reside in the Conexus Radio Frequency Telemetry Protocol—a wireless communication system used by some of Medtronic defibrillators and their control units to wirelessly connect to implanted devices over the air using radio-waves.", "\n", "\n", "\n", "\nAccording to an advisory [", "] published by Medtronic, these flaws affect more than 20 products, 16 of which are implantable defibrillators and rest are the defibrillators' bedside monitors and programmers.", "\n", "\nThe more critical flaw of the two is CVE-2019-6538 which occurs because the Conexus telemetry protocol does not include any checks for data tampering, nor performs any form of authentication or authorization.", "\n", "\nThe successful exploitation of this vulnerability could allow an attacker within the radio range of the affected device and right radio gear to intercept, spoof, or modify data transmitting between the device and its controller, which could potentially harm or perhaps even kill the patient.", "\n", "\n", "\n", "\n", "\n", "\nThe Conexus telemetry protocol also provides no encryption to secure the telemetry communications, making it possible for attackers within the range to eavesdrop on the communication. This issue has been assigned CVE-2019-6540.", "\n", "\nHowever, Medtronic said the vulnerabilities would be hard to take advantage of and harm patients since it requires the following conditions to be met:", "\n", "\n", "\n", "\nThe medical technology giant also assures its users that \"neither a cyberattack nor patient harm has been observed or associated with these vulnerabilities\" to this date.", "\n", "\nMedtronic also noted that its line of implanted pacemakers, including those with Bluetooth wireless functionality, as well as its CareLink Express monitors and CareLink Encore programmers (Model 29901) used by some hospitals and clinics are not vulnerable to either of these flaws.", "\n", "\nMedtronic has already applied additional controls for monitoring and responding to the abuse of the Conexus protocol by the affected implanted cardiac devices and is working on a fix to address the reported vulnerabilities.", "\n", "\nThe security fix will soon become available, and in the meantime, Medtronic urged \"patients and physicians continue to use these devices as prescribed and intended.\""], "img_link": ["https://1.bp.blogspot.com/-_iY0SGKc8Jk/XJTIDLWzAcI/AAAAAAAAzlE/xI0FpEy8idAMeiA-6h0aoL7PWMJp9J3sgCLcBGAs/s728-e100/hacking-medtronic-implantable-defibrillators.jpg"]},
{"title": ["Google Will Prompt European Android Users to Select Preferred Default Browser"], "date": ["March 20, 2019"], "author": ["Swati Khandelwal"], "content": ["\n", "\nGoogle announced some ", " mobile operating system in October after the European Commission hit the company with a ", " for pre-installing its own apps and services on third-party Android phones.", "\n", "\nThe European Commission accused Google of forcing Android phone manufacturers to \"illegally\" tie its proprietary apps and services—specifically, Chrome and Google Search as the default browsers—to Android, unfairly ", " from reaching consumers.", "\n", "\nThis rule led Google to change the way it licenses the Google mobile application suite to Android smartphone makers. Now, Google is further making some changes related to browser and search engine choice.", "\n", "\nIn a ", " published Tuesday, Google announced that the company would prompt Android phone owners in Europe (new and existing ones) in the coming months to choose from a variety of web browsers and search engines for their devices as their default apps.", "\n", "\n", "\n", "\nAlthough Google did not specify, the prompt will likely appear during the phone setup phase.", "\n", "\nThe move comes a few months after Google revealed its ", " for Google apps on third-party Android smartphones.", "\n", "\nThe new licensing scheme applied only to Android devices in the European Economic Area (comprises the 28 EU countries along with Iceland, Liechtenstein, and Norway) and required phone makers to obtain separate, paid licenses if they want to include:", "\n", "\n", "\n", "\nThis change allowed smartphone makers in Europe to install any app they want to serve as alternatives to Google apps without being forced to bundle Google Search and Chrome.", "\n", "\nGoogle also said Android users have always been free to download any browser and search engine apps they want, \"irrespective of what came pre-installed on the phone,\" noting that \"a typical Android phone user will usually install around 50 additional apps on their phone.\"", "\n", "\nThe company has likely come up with these latest changes to show the European Union its \"continued commitment to operating in an open and principled way.\"", "\n", "\nNot just for Google's mobile operating system, but the European Union also fined Google ", " over abusing the way it prioritizes its own shopping results at the top of its search results at the expense of its rival products.", "\n", "\nIn the latest blog post, the tech giant also announced some changes to Google Shopping, which includes providing \"direct links to comparison shopping sites, alongside specific product offers from merchants.\""], "img_link": ["https://1.bp.blogspot.com/-GCRd7pgvMo0/XJNQNeeAXGI/AAAAAAAAzkA/kMCx3PuPDlknUOrkg2LWUW-ezItH7HD0wCLcBGAs/s728-e100/european-union-google-chrome-browser-antitrust.png"]}
]